stm32duino/Arduino_Core_STM32/boards.txt
# Generic F401RD
GenF4.menu.pnum.Generic_F401RD=Generic F401RD
GenF4.menu.pnum.Generic_F401RD.upload.maximum_size=393216
GenF4.menu.pnum.Generic_F401RD.upload.maximum_data_size=98304
GenF4.menu.pnum.Generic_F401RD.build.board=GENERIC_F401RD
GenF4.menu.pnum.Generic_F401RD.build.product_line=STM32F401xE
GenF4.menu.pnum.Generic_F401RD.build.variant=Generic_F401Rx
GenF4.menu.pnum.Generic_F401RD.node=NODE_F401RE

# Generic F401RC
GenF4.menu.pnum.Generic_F401RC=Generic F401RC
GenF4.menu.pnum.Generic_F401RC.upload.maximum_size=262144
GenF4.menu.pnum.Generic_F401RC.upload.maximum_data_size=65536
GenF4.menu.pnum.Generic_F401RC.build.board=GENERIC_F401RC
GenF4.menu.pnum.Generic_F401RC.build.product_line=STM32F401xC
GenF4.menu.pnum.Generic_F401RC.build.variant=Generic_F401Rx
GenF4.menu.pnum.Generic_F401RC.node=NODE_F401RE

# Generic F401RB
GenF4.menu.pnum.Generic_F401RB=Generic F401RB
GenF4.menu.pnum.Generic_F401RB.upload.maximum_size=131072
GenF4.menu.pnum.Generic_F401RB.upload.maximum_data_size=65536
GenF4.menu.pnum.Generic_F401RB.build.board=GENERIC_F401RB
GenF4.menu.pnum.Generic_F401RB.build.product_line=STM32F401xC
GenF4.menu.pnum.Generic_F401RB.build.variant=Generic_F401Rx
GenF4.menu.pnum.Generic_F401RB.node=NODE_F401RE

# Upload menu
GenF4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF4.menu.upload_method.swdMethod.upload.protocol=0
GenF4.menu.upload_method.swdMethod.upload.options=-g
GenF4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF4.menu.upload_method.serialMethod.upload.protocol=1
GenF4.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF4.menu.upload_method.dfuMethod.upload.protocol=2
GenF4.menu.upload_method.dfuMethod.upload.options=-g
GenF4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF4.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# Generic L0
GenL0.name=Generic STM32L0 series

GenL0.build.vid=0x0483
GenL0.build.core=arduino
GenL0.build.board=GenL0
GenL0.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
GenL0.build.mcu=cortex-m0plus
GenL0.build.series=STM32L0xx
GenL0.build.cmsis_lib_gcc=arm_cortexM0l_math

# ThunderPack
GenL0.menu.pnum.THUNDER_PACK=ThunderPack
GenL0.menu.pnum.THUNDER_PACK.upload.maximum_size=196608
GenL0.menu.pnum.THUNDER_PACK.upload.maximum_data_size=20480
GenL0.menu.pnum.THUNDER_PACK.build.board=THUNDER_PACK
GenL0.menu.pnum.THUNDER_PACK.build.product_line=STM32L072xx
GenL0.menu.pnum.THUNDER_PACK.build.variant=THUNDER_PACK

# Piconomix PX-HER0 board
GenL0.menu.pnum.PX_HER0=PX-HER0
GenL0.menu.pnum.PX_HER0.upload.maximum_size=131072
GenL0.menu.pnum.PX_HER0.upload.maximum_data_size=20480
GenL0.menu.pnum.PX_HER0.build.board=PX_HER0
GenL0.menu.pnum.PX_HER0.build.product_line=STM32L072xx
GenL0.menu.pnum.PX_HER0.build.variant=PX_HER0

# Upload menu
GenL0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL0.menu.upload_method.swdMethod.upload.protocol=0
GenL0.menu.upload_method.swdMethod.upload.options=-g
GenL0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL0.menu.upload_method.serialMethod.upload.protocol=1
GenL0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL0.menu.upload_method.dfuMethod.upload.protocol=2
GenL0.menu.upload_method.dfuMethod.upload.options=-g
GenL0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenL0.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenL0.menu.upload_method.bmpMethod.upload.tool=bmp_upload

################################################################################
# Electronic Speed Controller boards

ESC_board.name=Electronic speed controllers

ESC_board.build.vid=0x0483
ESC_board.build.core=arduino
ESC_board.build.board=FCE_board
ESC_board.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# Wraith32_V1 board
ESC_board.menu.pnum.Wraith32_V1=Wraith V1 ESC
ESC_board.menu.pnum.Wraith32_V1.upload.maximum_size=32768
ESC_board.menu.pnum.Wraith32_V1.upload.maximum_data_size=7936
ESC_board.menu.pnum.Wraith32_V1.build.mcu=cortex-m0
ESC_board.menu.pnum.Wraith32_V1.build.board=Wraith32_V1
ESC_board.menu.pnum.Wraith32_V1.build.series=STM32F0xx
ESC_board.menu.pnum.Wraith32_V1.build.product_line=STM32F051x8
ESC_board.menu.pnum.Wraith32_V1.build.variant=WRAITH32_F051K6
ESC_board.menu.pnum.Wraith32_V1.build.cmsis_lib_gcc=arm_cortexM0l_math

# Upload menu
ESC_board.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
ESC_board.menu.upload_method.swdMethod.upload.protocol=0
ESC_board.menu.upload_method.swdMethod.upload.options=-g
ESC_board.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
ESC_board.menu.upload_method.serialMethod.upload.protocol=1
ESC_board.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
ESC_board.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

ESC_board.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
ESC_board.menu.upload_method.dfuMethod.upload.protocol=2
ESC_board.menu.upload_method.dfuMethod.upload.options=-g
ESC_board.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# LoRa boards

LoRa.name=LoRa boards

