stm32duino/Arduino_Core_STM32/boards.txt
Genericflight.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Genericflight.menu.upload_method.serialMethod.upload.protocol=1
Genericflight.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Genericflight.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Genericflight.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Genericflight.menu.upload_method.dfuMethod.upload.protocol=2
Genericflight.menu.upload_method.dfuMethod.upload.options=-g
Genericflight.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Genericflight.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
Genericflight.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
Genericflight.menu.upload_method.bmpMethod.upload.tool=bmp_upload

Genericflight.menu.upload_method.hidMethod=HID Bootloader 2.2
Genericflight.menu.upload_method.hidMethod.upload.protocol=hid22
Genericflight.menu.upload_method.hidMethod.upload.tool=hid_upload
Genericflight.menu.upload_method.hidMethod.build.flash_offset=0x800
Genericflight.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

Genericflight.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
Genericflight.menu.upload_method.dfu2Method.upload.protocol=maple
Genericflight.menu.upload_method.dfu2Method.upload.tool=maple_upload
Genericflight.menu.upload_method.dfu2Method.upload.usbID=1EAF:0003
Genericflight.menu.upload_method.dfu2Method.upload.altID=2
Genericflight.menu.upload_method.dfu2Method.build.flash_offset=0x2000
Genericflight.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

Genericflight.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
Genericflight.menu.upload_method.dfuoMethod.upload.protocol=maple
Genericflight.menu.upload_method.dfuoMethod.upload.tool=maple_upload
Genericflight.menu.upload_method.dfuoMethod.upload.usbID=1EAF:0003
Genericflight.menu.upload_method.dfuoMethod.upload.altID=1
Genericflight.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
Genericflight.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# Midatronics boards

Midatronics.name=Midatronics boards

Midatronics.build.vid=0x0483
Midatronics.build.core=arduino
Midatronics.build.board=Midatronics
Midatronics.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# MKR_SHARKY board
Midatronics.menu.pnum.MKR_SHARKY=MKR Sharky
Midatronics.menu.pnum.MKR_SHARKY.node=NODE_WB55CE
Midatronics.menu.pnum.MKR_SHARKY.upload.maximum_size=524288
Midatronics.menu.pnum.MKR_SHARKY.upload.maximum_data_size=196604
Midatronics.menu.pnum.MKR_SHARKY.build.mcu=cortex-m4
Midatronics.menu.pnum.MKR_SHARKY.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Midatronics.menu.pnum.MKR_SHARKY.build.board=MKR_SHARKY
Midatronics.menu.pnum.MKR_SHARKY.build.series=STM32WBxx
Midatronics.menu.pnum.MKR_SHARKY.build.product_line=STM32WB55xx
Midatronics.menu.pnum.MKR_SHARKY.build.variant=MKR_SHARKY
Midatronics.menu.pnum.MKR_SHARKY.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
Midatronics.menu.upload_method.MassStorage=Mass Storage
Midatronics.menu.upload_method.MassStorage.upload.protocol=
Midatronics.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Midatronics.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Midatronics.menu.upload_method.swdMethod.upload.protocol=0
Midatronics.menu.upload_method.swdMethod.upload.options=-g
Midatronics.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Midatronics.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Midatronics.menu.upload_method.serialMethod.upload.protocol=1
Midatronics.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Midatronics.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Midatronics.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Midatronics.menu.upload_method.dfuMethod.upload.protocol=2
Midatronics.menu.upload_method.dfuMethod.upload.options=-g
Midatronics.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Serialx activation
Nucleo_144.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_144.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_144.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_144.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_144.menu.xserial.disabled.build.xSerial=

Nucleo_64.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_64.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_64.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_64.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_64.menu.xserial.disabled.build.xSerial=

Nucleo_32.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_32.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_32.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_32.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_32.menu.xserial.disabled.build.xSerial=

Disco.menu.xserial.generic=Enabled (generic 'Serial')
Disco.menu.xserial.none=Enabled (no generic 'Serial')
Disco.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Disco.menu.xserial.disabled=Disabled (no Serial support)
Disco.menu.xserial.disabled.build.xSerial=

Eval.menu.xserial.generic=Enabled (generic 'Serial')
Eval.menu.xserial.none=Enabled (no generic 'Serial')
Eval.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Eval.menu.xserial.disabled=Disabled (no Serial support)
Eval.menu.xserial.disabled.build.xSerial=

STM32MP1.menu.xserial.generic=UART only (generic 'Serial')
STM32MP1.menu.xserial.generic.build.xSerial=-DHAL_UART_MODULE_ENABLED
STM32MP1.menu.xserial.none=UART only (no generic 'Serial')
STM32MP1.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
STM32MP1.menu.xserial.disabled=Disabled (no Serial support)
STM32MP1.menu.xserial.disabled.build.xSerial=

GenF0.menu.xserial.generic=Enabled (generic 'Serial')
GenF0.menu.xserial.none=Enabled (no generic 'Serial')
GenF0.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF0.menu.xserial.disabled=Disabled (no Serial support)
GenF0.menu.xserial.disabled.build.xSerial=

GenF1.menu.xserial.generic=Enabled (generic 'Serial')
GenF1.menu.xserial.none=Enabled (no generic 'Serial')
GenF1.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF1.menu.xserial.disabled=Disabled (no Serial support)
GenF1.menu.xserial.disabled.build.xSerial=

GenF3.menu.xserial.generic=Enabled (generic 'Serial')
GenF3.menu.xserial.none=Enabled (no generic 'Serial')
GenF3.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF3.menu.xserial.disabled=Disabled (no Serial support)
GenF3.menu.xserial.disabled.build.xSerial=

GenF4.menu.xserial.generic=Enabled (generic 'Serial')
GenF4.menu.xserial.none=Enabled (no generic 'Serial')
GenF4.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF4.menu.xserial.disabled=Disabled (no Serial support)
GenF4.menu.xserial.disabled.build.xSerial=

